data_generation/Training_Cases/Case5/constant/cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
152470
(
0.0222947
0.0224412
0.0226023
0.0227795
0.0229745
0.0231889
0.0234248
0.0236843
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
0.0222947
0.0224412
0.0226023
0.0227795
0.0229745
0.0231889
0.0234248
0.0236843
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
166
(
0.114163
0.113886
0.113604
0.113317
0.113023
0.112724
0.112418
0.112107
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1437
(
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1529
(
0.022225
0.022225
0.022225
0.022225
0.022225
0.022225
0.022225
0.022225
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
