data_generation/Training_Cases/Case5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          74;
        startFace       303237;
    }
    outlet
    {
        type            patch;
        nFaces          166;
        startFace       303311;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       303477;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       303577;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1437;
        startFace       303677;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1529;
        startFace       305114;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152470;
        startFace       306643;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152470;
        startFace       459113;
    }
)

// ************************************************************************* //
